read_verilog -sv rtl/alu.sv rtl/decoder.sv rtl/regfile.sv rtl/imem.sv rtl/dmem_stub.sv rtl/rv32i_core.sv rtl/top_single_cycle.sv
hierarchy -check -top top_single_cycle
proc
opt
fsm
opt
memory
opt
techmap
opt
abc -fast
opt
stat
check
write_verilog -noattr reports/synth/netlists/top_single_cycle_synth.v
write_json reports/synth/json/top_single_cycle.json



